Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_i2s.c
#include <rtthread.h>
#include <rtdevice.h>
#include "drv_i2s.h"
#include "cy_pdl.h"
#include "mtb_hal.h"
#include "cybsp.h"
#include "IFX_asrc.h"
#include "drv_es8388.h"
#include <rthw.h>
#include <rtdevice.h>
#define DBG_TAG              "i2s"
#define DBG_LVL              DBG_INFO
#include <rtdbg.h>

typedef enum
{
    i2s_state_stop,
    i2s_state_read,
    i2s_state_write,
} ifx_i2s_state_t;

typedef struct
{
    rt_uint32_t data_len;
    rt_int16_t *data;
} i2s_playback_q_data_t;

static int16_t i2s_stereo_playback_buffer1[PLAYBACK_DATA_FRAME_SIZE] __attribute__((section(".cy_socmem_data"))) = { 0 };
static int16_t i2s_stereo_playback_buffer2[PLAYBACK_DATA_FRAME_SIZE] __attribute__((section(".cy_socmem_data"))) = { 0 };

static int16_t *active_i2s_playback_buffer_ptr = NULL;
static int16_t *inactive_i2s_playback_buffer_ptr = NULL;

bool first_frame = true;
bool i2s_deinit_flag = false;
bool i2s_skip_frame = false;

#if defined(BSP_USING_SDLPAL)
#define TX_FIFO_SIZE         (1024)
#else
#define TX_FIFO_SIZE         (4096)
#endif

static volatile bool i2s_data_ready_flag = false;

#if defined(BSP_USING_SDLPAL)
static volatile drv_i2s_sdlpal_metrics_t sdlpal_i2s_metrics;
static volatile rt_uint32_t sdlpal_replay_generation;
static volatile bool sdlpal_replay_active;

static void sdlpal_replay_transition(bool active)
{
    rt_base_t level = rt_hw_interrupt_disable();

    ++sdlpal_replay_generation;
    sdlpal_replay_active = active;
    rt_hw_interrupt_enable(level);
}

static bool sdlpal_replay_snapshot(rt_uint32_t *generation)
{
    rt_base_t level;
    bool active;

    level = rt_hw_interrupt_disable();
    *generation = sdlpal_replay_generation;
    active = sdlpal_replay_active;
    rt_hw_interrupt_enable(level);
    return active;
}

static bool sdlpal_replay_is_current(rt_uint32_t generation)
{
    rt_base_t level;
    bool current;

    level = rt_hw_interrupt_disable();
    current = sdlpal_replay_active &&
              generation == sdlpal_replay_generation;
    rt_hw_interrupt_enable(level);
    return current;
}

void drv_i2s_sdlpal_metrics_get(drv_i2s_sdlpal_metrics_t *metrics)
{
    rt_base_t level;

    if (metrics == RT_NULL)
    {
        return;
    }
    level = rt_hw_interrupt_disable();
    metrics->tx_messages = sdlpal_i2s_metrics.tx_messages;
    metrics->rx_messages = sdlpal_i2s_metrics.rx_messages;
    metrics->fifo_irqs = sdlpal_i2s_metrics.fifo_irqs;
    metrics->sem_releases = sdlpal_i2s_metrics.sem_releases;
    metrics->completion_requests = sdlpal_i2s_metrics.completion_requests;
    metrics->mq_send_failures = sdlpal_i2s_metrics.mq_send_failures;
    metrics->underruns = sdlpal_i2s_metrics.underruns;
    rt_hw_interrupt_enable(level);
}

static void sdlpal_request_next_frame(struct rt_audio_device *audio)
{
    ++sdlpal_i2s_metrics.completion_requests;
    rt_audio_tx_complete(audio);
}
#endif

uint8_t i2s_playback_volume = DEFAULT_VOLUME;
/* ASRC variables for down-sampling audio to 16000Hz */
IFX_ASRC_STRUCT_t asrc_mem_down_sampling;
#if SAMPLING_RATE_44_1kHz == SAMPLING_RATE
/* ASRC variables for up-sampling 44100Hz to 48000Hz */
IFX_ASRC_STRUCT_t asrc_mem_up_sampling;
#endif /* SAMPLING_RATE_44_1kHz */

// static rt_uint32_t input_sampling_freq = 0;
// static rt_uint32_t output_sampling_freq = 0;
// static uint16_t asrc_out_len = 0;

/* Definition of buffers for ASRC, AEC and I2S */
// static int32_t asrc_in_i2s_playback_buffer_32bit[FRAME_SIZE]           __attribute__ ((section(".cy_socmem_data"))) = { 0 };
// static int32_t asrc_out_aec_ref_buffer_32bit[ASRC_OUTPUT_BUFFER_SIZE]  __attribute__ ((section(".cy_socmem_data"))) = { 0 };
// static int16_t asrc_out_aec_ref_buffer_16bit[AEC_REF_FRAME_SIZE]       __attribute__ ((section(".cy_socmem_data"))) = { 0 };
#if SAMPLING_RATE_44_1kHz == SAMPLING_RATE
static int16_t asrc_out_up_sampled_buffer_16bit[PLAYBACK_DATA_FRAME_SIZE / 2]  __attribute__((section(".cy_socmem_data"))) = { 0 };
#endif /* SAMPLING_RATE_44_1kHz */
static int16_t i2s_stereo_zero_buffer[PLAYBACK_DATA_FRAME_SIZE]        __attribute__((section(".cy_socmem_data"))) = { 0 };
static int16_t aec_ref_zero_buffer[AEC_REF_FRAME_SIZE]                 __attribute__((section(".cy_socmem_data"))) = { 0 };
int16_t *i2s_playback_ptr = i2s_stereo_zero_buffer;

/* Pointer declarations for AEC Reference ASRC implementation */
// static int16_t* frame_in_buffer;
// static int16_t* frame_out_buffer;
static int16_t *aec_ref_cb_ptr = NULL;

uint8_t i2s_32_samples_frame_count = 0;

const cy_stc_sysint_t i2s_isr_txcfg =
{
    .intrSrc = (IRQn_Type) tdm_0_interrupts_tx_0_IRQn,
    .intrPriority = I2S_INTR_PRIORITY,
};

struct sound_device
{
    struct rt_audio_device audio;
    struct rt_audio_configure audio_config;
    char *dev_name;

    rt_uint8_t *tx_buff;
    rt_mq_t tx_mq;
    rt_sem_t tx_sem;

    rt_uint8_t *rx_buff;
    ifx_i2s_state_t i2s_state;
    rt_uint8_t volume;

    rt_thread_t playback_thread;
};
static struct sound_device snd_dev = {0};

static char msg_pool[512];

bool music_player_active = false;
bool music_player_pause = false;

typedef struct
{
    rt_uint32_t data_len;
    uint8_t *data;
} music_player_q_data_t;

void i2s_playback_task(void *arg);

void ifx_i2s_init(void)
{
    /* Initialize the I2S interrupt */
    Cy_SysInt_Init(&i2s_isr_txcfg, i2s_tx_interrupt_handler);
    NVIC_EnableIRQ(i2s_isr_txcfg.intrSrc);

    /* Initialize the I2S */
    cy_en_tdm_status_t volatile return_status = Cy_AudioTDM_Init(TDM_STRUCT0, &CYBSP_TDM_CONTROLLER_0_config);
    if (CY_TDM_SUCCESS != return_status)
    {
        RT_ASSERT(0);
    }

    /* Clear TX interrupts */
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    Cy_AudioTDM_SetTxInterruptMask(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
}
void ifx_i2s_deinit()
{
    i2s_deinit_flag = true;

    if (!first_frame)
    {
        Cy_AudioTDM_DeActivateTx(TDM_STRUCT0_TX);
        Cy_AudioI2S_DisableTx(TDM_STRUCT0_TX);

        // Cy_AudioTDM_DeInit(TDM_STRUCT0_TX);
        first_frame = true;
    }
}

void ifx_set_samplerate(struct rt_audio_configure audio_config)
{
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U);
    if (audio_config.channels == 1)
    {
        switch (audio_config.samplerate)
        {
            case 16000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 24U, 0U);
                break;
            case 24000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 16U, 0U);
                break;
            case 48000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 8U, 0U);
                break;
            case 96000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 3U, 0U);
                break;
            default:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 24U, 0U);
                break;
        }
    }
    else
    {
        switch (audio_config.samplerate)
        {
            case 16000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 11U, 0U);
                break;
            case 24000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 7U, 0U);
                break;
            case 48000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 3U, 0U);
                break;
            case 96000:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 1U, 0U);
                break;
            default:
                Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 11U, 0U);
                break;
        }
    }
    #if defined(BSP_USING_XiaoZhi)
        Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U, 15U, 0U);
    #endif
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 0U);
}

