Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_i2s.c
static rt_err_t sound_start(struct rt_audio_device *audio, int stream)
{
    RT_ASSERT(audio != RT_NULL);

    if (stream == AUDIO_STREAM_REPLAY)
    {
#if defined(BSP_USING_SDLPAL)
        struct sound_device *snd_dev =
            (struct sound_device *)audio->parent.user_data;

        sdlpal_replay_transition(false);
        sdlpal_reset_playback_state(snd_dev, false);
        rt_memset((void *)&sdlpal_i2s_metrics, 0,
                  sizeof(sdlpal_i2s_metrics));
        sdlpal_replay_transition(true);
#endif
        music_player_active = true;
        LOG_I("Ready for I2S output \r\n");
#if defined(BSP_USING_SDLPAL)
        sdlpal_request_next_frame(audio);
#else
        rt_audio_tx_complete(audio);
#endif
    }

    return RT_EOK;
}

static rt_ssize_t sound_transmit(struct rt_audio_device *audio, const void *writeBuf, void *readBuf, rt_size_t size)
{
    struct sound_device *snd_dev;
    RT_ASSERT(audio != RT_NULL);
    snd_dev = (struct sound_device *)audio->parent.user_data;
    if (size > 0)
    {
        i2s_playback_q_data_t i2s_playback_q_data;
        i2s_playback_q_data.data_len = size >> 1;
        i2s_playback_q_data.data = (rt_int16_t *) writeBuf;
#if defined(BSP_USING_SDLPAL)
        if (rt_mq_send(snd_dev->tx_mq, &i2s_playback_q_data,
                       sizeof(i2s_playback_q_data_t)) == RT_EOK)
        {
            ++sdlpal_i2s_metrics.tx_messages;
        }
        else
        {
            ++sdlpal_i2s_metrics.mq_send_failures;
        }
#else
        rt_mq_send(snd_dev->tx_mq, &i2s_playback_q_data, sizeof(i2s_playback_q_data_t));
#endif
    }
    return size;
}

static rt_err_t sound_stop(struct rt_audio_device *audio, int stream)
{
    RT_ASSERT(audio != RT_NULL);
    if (stream == AUDIO_STREAM_REPLAY)
    {
#if defined(BSP_USING_SDLPAL)
        struct sound_device *snd_dev =
            (struct sound_device *)audio->parent.user_data;

        music_player_active = false;
        sdlpal_replay_transition(false);
        sdlpal_reset_playback_state(snd_dev, true);
        rt_data_queue_reset(&audio->replay->queue);
        audio->replay->write_index = 0u;
        audio->replay->read_index = 0u;
        audio->replay->pos = 0u;
#else
//        music_player_active = false;
//        first_frame=true;
//        app_i2s_deactivate();
//        rt_thread_detach(snd_dev->playback_thread);
//        while(audio->replay->queue.is_empty==0)
//        rt_data_queue_reset(&audio->replay->queue);
//        audio->replay->write_index = 0;
//        audio->replay->read_index = 0;
//        audio->replay->pos = 0;
//        i2s_data_ready_flag = false;

//            rt_audio_tx_complete(audio);
#endif
        LOG_D("Sound Stop.");
    }

    return RT_EOK;
}

static void sound_buffer_info(struct rt_audio_device *audio, struct rt_audio_buf_info *info)
{
    struct sound_device *snd_dev;
    RT_ASSERT(audio != RT_NULL);
    snd_dev = (struct sound_device *)audio->parent.user_data;

    /**
     *               TX_FIFO
     * +----------------+----------------+
     * |     block1     |     block2     |
     * +----------------+----------------+
     *  \  block_size  /
     */
    info->buffer      = snd_dev->tx_buff;
    info->total_size  = TX_FIFO_SIZE;
    info->block_size  = TX_FIFO_SIZE / 2;
    info->block_count = 2;
}



static struct rt_audio_ops snd_ops =
{
    .getcaps     = sound_getcaps,
    .configure   = sound_configure,
    .init        = sound_init,
    .start       = sound_start,
    .stop        = sound_stop,
    .transmit    = sound_transmit,
    .buffer_info = sound_buffer_info,
};

int rt_hw_sound_init(void)
{
    rt_err_t ret = RT_EOK;
    rt_uint8_t *tx_buff;

    tx_buff = (rt_uint8_t *)rt_malloc(TX_FIFO_SIZE);

#if defined(BSP_USING_SDLPAL)
    if (tx_buff == RT_NULL)
        return -RT_ENOMEM;
    rt_memset(tx_buff, 0, TX_FIFO_SIZE);
#else
    rt_memset(tx_buff, 0, TX_FIFO_SIZE);
    if (tx_buff == RT_NULL)
        return -RT_ENOMEM;
#endif
    snd_dev.tx_buff = tx_buff;
    /* init default configuration */
    snd_dev.audio_config.samplerate = 16000;
    snd_dev.audio_config.channels   = 2;
    snd_dev.audio_config.samplebits = 16;
    snd_dev.volume                   = 70;

    snd_dev.audio.ops = &snd_ops;

    snd_dev.tx_mq = rt_mq_create(
                        "sound_tx_mq",
                        sizeof(i2s_playback_q_data_t),
                        sizeof(msg_pool),
                        RT_IPC_FLAG_FIFO);
#if defined(BSP_USING_SDLPAL)
    if (snd_dev.tx_mq == RT_NULL)
    {
        LOG_E("create sound tx_mq failed.\n");
        rt_free(snd_dev.tx_buff);
        snd_dev.tx_buff = RT_NULL;
        return -RT_ERROR;
    }
#endif

    snd_dev.tx_sem = rt_sem_create("sound_tx_sem", 0, RT_IPC_FLAG_FIFO);
    if (snd_dev.tx_sem == RT_NULL)
    {
        LOG_E("create sound tx_sem failed.\n");
#if defined(BSP_USING_SDLPAL)
        rt_mq_delete(snd_dev.tx_mq);
        rt_free(snd_dev.tx_buff);
        snd_dev.tx_mq = RT_NULL;
        snd_dev.tx_buff = RT_NULL;
#endif
        return -RT_ERROR;
    }


    snd_dev.playback_thread = rt_thread_create("sound_thread", i2s_playback_task, (void *)&snd_dev.audio, I2S_PLAYBACK_TASK_STACK_SIZE, I2S_PLAYBACK_TASK_PRIORITY, 10);
    if (snd_dev.playback_thread == RT_NULL)
    {
        LOG_E("Error in I2S playback task \r\n");
#if defined(BSP_USING_SDLPAL)
        rt_sem_delete(snd_dev.tx_sem);
        rt_mq_delete(snd_dev.tx_mq);
        rt_free(snd_dev.tx_buff);
        snd_dev.tx_sem = RT_NULL;
        snd_dev.tx_mq = RT_NULL;
        snd_dev.tx_buff = RT_NULL;
        return -RT_ERROR;
#else
        RT_ASSERT(snd_dev.playback_thread != RT_NULL);
#endif
    }

    ret = rt_audio_register(&snd_dev.audio, "sound0", RT_DEVICE_FLAG_WRONLY, &snd_dev);

    if (ret != RT_EOK)
    {
        LOG_E("rt_audio %s register failed, status=%d\n", "sound0", ret);
#if defined(BSP_USING_SDLPAL)
        rt_thread_delete(snd_dev.playback_thread);
        rt_sem_delete(snd_dev.tx_sem);
        rt_mq_delete(snd_dev.tx_mq);
        rt_free(snd_dev.tx_buff);
        snd_dev.playback_thread = RT_NULL;
        snd_dev.tx_sem = RT_NULL;
        snd_dev.tx_mq = RT_NULL;
        snd_dev.tx_buff = RT_NULL;
#endif
        return -RT_ERROR;
    }

