Rbb666/sdk-bsp-psoc_e84-edgi-talk/libraries/HAL_Drivers/drv_i2s.c
    return RT_EOK;
}
INIT_DEVICE_EXPORT(rt_hw_sound_init);

void i2s_write_32_samples(void)
{
    i2s_32_samples_frame_count = 1;
    for (int i = 0; i < HW_FIFO_SIZE; i++)
    {
        /* Write same data for L,R channels(dual mono) in FIFO */
        Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) * ((i2s_playback_ptr + (HW_FIFO_SIZE * (i2s_32_samples_frame_count - 1))) + i));
        i++;
        Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) * ((i2s_playback_ptr + (HW_FIFO_SIZE * (i2s_32_samples_frame_count - 1))) + i));
    }
    i2s_32_samples_frame_count = 2;
}

void convert_mono_to_stereo(int16_t *mono_data, rt_uint32_t mono_data_num_samples,
                            int16_t *stereo_data)
{
    for (rt_uint32_t i = 0; i < mono_data_num_samples; i++)
    {
        *stereo_data++ = *mono_data;  // Copy the mono sample to the left channel
        *stereo_data++ = *mono_data;  // Copy the same mono sample to the right channel
        mono_data++;  // Move to the next mono sample
    }
}

#if defined(BSP_USING_SDLPAL)
static void sdlpal_prime_first_frame(void)
{
    i2s_playback_ptr = active_i2s_playback_buffer_ptr;
    i2s_data_ready_flag = false;
    app_i2s_enable();
    i2s_write_32_samples();
    app_i2s_activate();
}

#endif

void i2s_playback_task(void *arg)
{
    struct rt_audio_device *audio = (struct rt_audio_device *)arg;
    struct sound_device *snd_dev;
    RT_ASSERT(audio != RT_NULL);
    snd_dev = (struct sound_device *)audio->parent.user_data;
#if defined(PKG_USING_WAVPLAYER) && !defined(BSP_USING_XiaoZhi)
    static int count = 0;
#endif
    int16_t *temp_buffer_ptr;

    // int32_t* asrc_out_ptr = NULL;

    i2s_playback_q_data_t i2s_playback_q_data;
#if defined(BSP_USING_SDLPAL)
    rt_uint32_t replay_generation;
    rt_ssize_t received;
#endif

    active_i2s_playback_buffer_ptr = i2s_stereo_playback_buffer1;
    inactive_i2s_playback_buffer_ptr = i2s_stereo_playback_buffer2;

    while (1)
    {
#if defined(BSP_USING_SDLPAL)
        received = rt_mq_recv(snd_dev->tx_mq, &i2s_playback_q_data,
                              sizeof(i2s_playback_q_data_t),
                              RT_WAITING_FOREVER);
        if (received != (rt_ssize_t)sizeof(i2s_playback_q_data_t))
        {
            continue;
        }
        ++sdlpal_i2s_metrics.rx_messages;
        if (!sdlpal_replay_snapshot(&replay_generation))
        {
            continue;
        }
#else
        rt_mq_recv(snd_dev->tx_mq, &i2s_playback_q_data, sizeof(i2s_playback_q_data_t), RT_WAITING_FOREVER);
#endif

        /* Clear the flags, queues and notifications in case of I2S de-init.
         * This occurs when the "Stop Music" command is given.
         */
        if (i2s_deinit_flag)
        {
            i2s_deinit_flag = false;
            first_frame = true;
            rt_memset(&msg_pool[0], 0, sizeof(msg_pool));
            continue;
        }

#if SAMPLING_RATE_44_1kHz == SAMPLING_RATE
        /* The 'first_frame' flag is set only during the 1st frame of
        * playback for a new file.
        */
        if (first_frame)
        {

            /* Initialize ASRC for up sampling 44.1KHz to 48kHz playback data */
            input_sampling_freq = SAMPLING_RATE_44_1kHz;
            output_sampling_freq = SAMPLING_RATE_48kHz;

            init_IFX_asrc(&asrc_mem_up_sampling, input_sampling_freq, output_sampling_freq);
            IFX_SetClockDrift(&asrc_mem_up_sampling, 0);
        }

        frame_in_buffer = (int16_t *) i2s_playback_q_data.data;
        for (rt_uint32_t i = 0; i < FRAME_SIZE; i++)
        {
            asrc_in_i2s_playback_buffer_32bit[i] = (int32_t)
                                                   (*(int16_t *)frame_in_buffer);
            frame_in_buffer ++;
        }
        asrc_out_len = ASRC_OUTPUT_BUFFER_SIZE;
        asrc_out_ptr = asrc_out_aec_ref_buffer_32bit;
        frame_out_buffer = asrc_out_up_sampled_buffer_16bit;
        /* IFX_asrc() called 2 times to pass 441 samples, 240 and 201 in each call.*/
        for (rt_uint32_t i = 0; i < ASRC_NUM_ITERATIONS_PER_FRAME; i++)
        {
            if ((ASRC_NUM_ITERATIONS_PER_FRAME - 1) != i)
            {
                IFX_asrc(asrc_in_i2s_playback_buffer_32bit +
                         ASRC_INPUT_SAMPLES * i, ASRC_INPUT_SAMPLES,
                         asrc_out_ptr, &asrc_out_len, &asrc_mem_up_sampling);
            }
            else
            {
                IFX_asrc(asrc_in_i2s_playback_buffer_32bit +
                         ASRC_INPUT_SAMPLES * i, 201,
                         asrc_out_ptr, &asrc_out_len, &asrc_mem_up_sampling);
            }
            /* Convert int32_t to int16_t */
            for (rt_uint32_t j = 0; j < asrc_out_len; j++)
            {
                *(frame_out_buffer++) = (int16_t)(*(asrc_out_ptr + j));
            }
            asrc_out_ptr += asrc_out_len;
        }
#endif

        /* Convert the input mono channel audio to stereo by appropriate zero
            * padding for playback over I2S.
            */
#if SAMPLING_RATE_44_1kHz == SAMPLING_RATE
        convert_mono_to_stereo((int16_t *)asrc_out_up_sampled_buffer_16bit,
                               (PLAYBACK_DATA_FRAME_SIZE / 2),
                               inactive_i2s_playback_buffer_ptr);
#else
        convert_mono_to_stereo((int16_t *)i2s_playback_q_data.data,
                               (i2s_playback_q_data.data_len),
                               inactive_i2s_playback_buffer_ptr);
#endif

        temp_buffer_ptr = active_i2s_playback_buffer_ptr;
        active_i2s_playback_buffer_ptr = inactive_i2s_playback_buffer_ptr;
        inactive_i2s_playback_buffer_ptr = temp_buffer_ptr;
        i2s_data_ready_flag = true;

        /* The 'first_frame' flag is set only during the 1st frame of
         * playback for a new file.
         */
        if (first_frame)
        {
#if SAMPLING_RATE_16kHz != SAMPLING_RATE
            /* Initialize ASRC for 16kHz AEC reference */
            input_sampling_freq = SAMPLING_RATE;
            output_sampling_freq = AEC_REF_SAMPLING_RATE;

            /* ASRC for 16KHz aec ref from 44.1KHz/48KHz playback data */
            init_IFX_asrc(&asrc_mem_down_sampling, input_sampling_freq, output_sampling_freq);
            IFX_SetClockDrift(&asrc_mem_down_sampling, 0);
#endif
            /* Only for the first frame, the I2S write happens from this task. */
            if (!i2s_deinit_flag)
            {
#if defined(BSP_USING_SDLPAL)
                if (!sdlpal_replay_is_current(replay_generation))
                {
                    continue;
                }
                rt_enter_critical();
                if (!sdlpal_replay_is_current(replay_generation))
                {
                    rt_exit_critical();
                    continue;
                }
                sdlpal_prime_first_frame();
                rt_exit_critical();
#else
                app_i2s_enable();

                for (int i = 0; i < HW_FIFO_SIZE; i++)
                {
                    /* Write same data for L,R channels(dual mono) in FIFO */
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) 0);
                    i++;
                    Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, (rt_uint32_t) 0);
                }
                app_i2s_activate();
#endif
                es8388_volume_set(snd_dev->volume);
            }
            i2s_data_ready_flag = false;
        }

        /* Perform ASRC for sampling rates apart from 16kHz and enqueue the
         * AEC reference data in a circular buffer.
         */
#if SAMPLING_RATE_16kHz != SAMPLING_RATE
        frame_in_buffer = (int16_t *) i2s_playback_q_data.data;
        for (rt_uint32_t i = 0; i < FRAME_SIZE; i++)
        {
            asrc_in_i2s_playback_buffer_32bit[i] = (int32_t)
                                                   (*(int16_t *)frame_in_buffer);
            frame_in_buffer ++;
        }

